{"class_name": "Model", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 299, 299, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block1_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv1_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block1_conv1_act"}, "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "name": "block1_conv1_act"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block1_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 64, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "name": "block1_conv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_conv2_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block1_conv2_act"}, "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "name": "block1_conv2_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 128, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block2_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "name": "block2_sepconv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "name": "block2_sepconv1_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block2_sepconv2_act"}, "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "name": "block2_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 128, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block2_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "name": "block2_sepconv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "name": "block2_sepconv2_bn"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "name": "block2_pool"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_1"}, "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block3_sepconv1_act"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "block3_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 256, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block3_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "name": "block3_sepconv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "name": "block3_sepconv1_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block3_sepconv2_act"}, "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "name": "block3_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 256, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block3_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "name": "block3_sepconv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "name": "block3_sepconv2_bn"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 256, "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "name": "block3_pool"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_2"}, "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "name": "add_2"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block4_sepconv1_act"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "block4_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block4_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "name": "block4_sepconv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "name": "block4_sepconv1_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block4_sepconv2_act"}, "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "name": "block4_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block4_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "name": "block4_sepconv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "name": "block4_sepconv2_bn"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 728, "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "name": "block4_pool"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_3"}, "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_3"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block5_sepconv1_act"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "block5_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block5_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "name": "block5_sepconv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "name": "block5_sepconv1_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block5_sepconv2_act"}, "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "name": "block5_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block5_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "name": "block5_sepconv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "name": "block5_sepconv2_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block5_sepconv3_act"}, "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "name": "block5_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block5_sepconv3", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "name": "block5_sepconv3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv3_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "name": "block5_sepconv3_bn"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_4"}, "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]], "name": "add_4"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block6_sepconv1_act"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "block6_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block6_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "name": "block6_sepconv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "name": "block6_sepconv1_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block6_sepconv2_act"}, "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "name": "block6_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block6_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "name": "block6_sepconv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "name": "block6_sepconv2_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block6_sepconv3_act"}, "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "name": "block6_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block6_sepconv3", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "name": "block6_sepconv3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv3_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]], "name": "block6_sepconv3_bn"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_5"}, "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]], "name": "add_5"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block7_sepconv1_act"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "block7_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block7_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]], "name": "block7_sepconv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block7_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]], "name": "block7_sepconv1_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block7_sepconv2_act"}, "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]], "name": "block7_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block7_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]], "name": "block7_sepconv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block7_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]], "name": "block7_sepconv2_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block7_sepconv3_act"}, "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]], "name": "block7_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block7_sepconv3", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]], "name": "block7_sepconv3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block7_sepconv3_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]], "name": "block7_sepconv3_bn"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_6"}, "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]], "name": "add_6"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block8_sepconv1_act"}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "block8_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block8_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]], "name": "block8_sepconv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block8_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]], "name": "block8_sepconv1_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block8_sepconv2_act"}, "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]], "name": "block8_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block8_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]], "name": "block8_sepconv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block8_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]], "name": "block8_sepconv2_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block8_sepconv3_act"}, "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]], "name": "block8_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block8_sepconv3", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]], "name": "block8_sepconv3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block8_sepconv3_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]], "name": "block8_sepconv3_bn"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_7"}, "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]], "name": "add_7"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block9_sepconv1_act"}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "block9_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block9_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]], "name": "block9_sepconv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block9_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]], "name": "block9_sepconv1_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block9_sepconv2_act"}, "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]], "name": "block9_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block9_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]], "name": "block9_sepconv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block9_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]], "name": "block9_sepconv2_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block9_sepconv3_act"}, "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]], "name": "block9_sepconv3_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block9_sepconv3", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]], "name": "block9_sepconv3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block9_sepconv3_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]], "name": "block9_sepconv3_bn"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_8"}, "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]], "name": "add_8"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block10_sepconv1_act"}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "block10_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block10_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]], "name": "block10_sepconv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block10_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]], "name": "block10_sepconv1_bn"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block10_sepconv2_act"}, "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]], "name": "block10_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "use_bias": false, "depthwise_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "name": "block10_sepconv2", "bias_constraint": null, "depth_multiplier": 1, 